NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
/* PIN15 @Bit 15 : Pin 15 */
  #define GPIO_DIR_PIN15_Pos (15UL)                  /*!< Position of PIN15 field.                                             */
  #define GPIO_DIR_PIN15_Msk (0x1UL << GPIO_DIR_PIN15_Pos) /*!< Bit mask of PIN15 field.                                       */
  #define GPIO_DIR_PIN15_Min (0x0UL)                 /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_DIR_PIN15_Max (0x1UL)                 /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_DIR_PIN15_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN15_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN16 @Bit 16 : Pin 16 */
  #define GPIO_DIR_PIN16_Pos (16UL)                  /*!< Position of PIN16 field.                                             */
  #define GPIO_DIR_PIN16_Msk (0x1UL << GPIO_DIR_PIN16_Pos) /*!< Bit mask of PIN16 field.                                       */
  #define GPIO_DIR_PIN16_Min (0x0UL)                 /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_DIR_PIN16_Max (0x1UL)                 /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_DIR_PIN16_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN16_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN17 @Bit 17 : Pin 17 */
  #define GPIO_DIR_PIN17_Pos (17UL)                  /*!< Position of PIN17 field.                                             */
  #define GPIO_DIR_PIN17_Msk (0x1UL << GPIO_DIR_PIN17_Pos) /*!< Bit mask of PIN17 field.                                       */
  #define GPIO_DIR_PIN17_Min (0x0UL)                 /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_DIR_PIN17_Max (0x1UL)                 /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_DIR_PIN17_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN17_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN18 @Bit 18 : Pin 18 */
  #define GPIO_DIR_PIN18_Pos (18UL)                  /*!< Position of PIN18 field.                                             */
  #define GPIO_DIR_PIN18_Msk (0x1UL << GPIO_DIR_PIN18_Pos) /*!< Bit mask of PIN18 field.                                       */
  #define GPIO_DIR_PIN18_Min (0x0UL)                 /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_DIR_PIN18_Max (0x1UL)                 /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_DIR_PIN18_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN18_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN19 @Bit 19 : Pin 19 */
  #define GPIO_DIR_PIN19_Pos (19UL)                  /*!< Position of PIN19 field.                                             */
  #define GPIO_DIR_PIN19_Msk (0x1UL << GPIO_DIR_PIN19_Pos) /*!< Bit mask of PIN19 field.                                       */
  #define GPIO_DIR_PIN19_Min (0x0UL)                 /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_DIR_PIN19_Max (0x1UL)                 /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_DIR_PIN19_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN19_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN20 @Bit 20 : Pin 20 */
  #define GPIO_DIR_PIN20_Pos (20UL)                  /*!< Position of PIN20 field.                                             */
  #define GPIO_DIR_PIN20_Msk (0x1UL << GPIO_DIR_PIN20_Pos) /*!< Bit mask of PIN20 field.                                       */
  #define GPIO_DIR_PIN20_Min (0x0UL)                 /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_DIR_PIN20_Max (0x1UL)                 /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_DIR_PIN20_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN20_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN21 @Bit 21 : Pin 21 */
  #define GPIO_DIR_PIN21_Pos (21UL)                  /*!< Position of PIN21 field.                                             */
  #define GPIO_DIR_PIN21_Msk (0x1UL << GPIO_DIR_PIN21_Pos) /*!< Bit mask of PIN21 field.                                       */
  #define GPIO_DIR_PIN21_Min (0x0UL)                 /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_DIR_PIN21_Max (0x1UL)                 /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_DIR_PIN21_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN21_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN22 @Bit 22 : Pin 22 */
  #define GPIO_DIR_PIN22_Pos (22UL)                  /*!< Position of PIN22 field.                                             */
  #define GPIO_DIR_PIN22_Msk (0x1UL << GPIO_DIR_PIN22_Pos) /*!< Bit mask of PIN22 field.                                       */
  #define GPIO_DIR_PIN22_Min (0x0UL)                 /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_DIR_PIN22_Max (0x1UL)                 /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_DIR_PIN22_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN22_Output (0x1UL)              /*!< Pin set as output                                                    */

