NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
/* RAMUNDERFLOW @Bit 8 : Read pending status of interrupt for event RAMUNDERFLOW */
  #define PWM_INTPEND_RAMUNDERFLOW_Pos (8UL)         /*!< Position of RAMUNDERFLOW field.                                      */
  #define PWM_INTPEND_RAMUNDERFLOW_Msk (0x1UL << PWM_INTPEND_RAMUNDERFLOW_Pos) /*!< Bit mask of RAMUNDERFLOW field.            */
  #define PWM_INTPEND_RAMUNDERFLOW_Min (0x0UL)       /*!< Min enumerator value of RAMUNDERFLOW field.                          */
  #define PWM_INTPEND_RAMUNDERFLOW_Max (0x1UL)       /*!< Max enumerator value of RAMUNDERFLOW field.                          */
  #define PWM_INTPEND_RAMUNDERFLOW_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define PWM_INTPEND_RAMUNDERFLOW_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* DMASEQ0END @Bit 9 : Read pending status of interrupt for event DMASEQ0END */
  #define PWM_INTPEND_DMASEQ0END_Pos (9UL)           /*!< Position of DMASEQ0END field.                                        */
  #define PWM_INTPEND_DMASEQ0END_Msk (0x1UL << PWM_INTPEND_DMASEQ0END_Pos) /*!< Bit mask of DMASEQ0END field.                  */
  #define PWM_INTPEND_DMASEQ0END_Min (0x0UL)         /*!< Min enumerator value of DMASEQ0END field.                            */
  #define PWM_INTPEND_DMASEQ0END_Max (0x1UL)         /*!< Max enumerator value of DMASEQ0END field.                            */
  #define PWM_INTPEND_DMASEQ0END_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define PWM_INTPEND_DMASEQ0END_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* DMASEQ0READY @Bit 10 : Read pending status of interrupt for event DMASEQ0READY */
  #define PWM_INTPEND_DMASEQ0READY_Pos (10UL)        /*!< Position of DMASEQ0READY field.                                      */
  #define PWM_INTPEND_DMASEQ0READY_Msk (0x1UL << PWM_INTPEND_DMASEQ0READY_Pos) /*!< Bit mask of DMASEQ0READY field.            */
  #define PWM_INTPEND_DMASEQ0READY_Min (0x0UL)       /*!< Min enumerator value of DMASEQ0READY field.                          */
  #define PWM_INTPEND_DMASEQ0READY_Max (0x1UL)       /*!< Max enumerator value of DMASEQ0READY field.                          */
  #define PWM_INTPEND_DMASEQ0READY_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define PWM_INTPEND_DMASEQ0READY_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* DMASEQ0BUSERROR @Bit 11 : Read pending status of interrupt for event DMASEQ0BUSERROR */
  #define PWM_INTPEND_DMASEQ0BUSERROR_Pos (11UL)     /*!< Position of DMASEQ0BUSERROR field.                                   */
  #define PWM_INTPEND_DMASEQ0BUSERROR_Msk (0x1UL << PWM_INTPEND_DMASEQ0BUSERROR_Pos) /*!< Bit mask of DMASEQ0BUSERROR field.   */
  #define PWM_INTPEND_DMASEQ0BUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMASEQ0BUSERROR field.                       */
  #define PWM_INTPEND_DMASEQ0BUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMASEQ0BUSERROR field.                       */
  #define PWM_INTPEND_DMASEQ0BUSERROR_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define PWM_INTPEND_DMASEQ0BUSERROR_Pending (0x1UL) /*!< Read: Pending                                                       */

/* DMASEQ1END @Bit 12 : Read pending status of interrupt for event DMASEQ1END */
  #define PWM_INTPEND_DMASEQ1END_Pos (12UL)          /*!< Position of DMASEQ1END field.                                        */
  #define PWM_INTPEND_DMASEQ1END_Msk (0x1UL << PWM_INTPEND_DMASEQ1END_Pos) /*!< Bit mask of DMASEQ1END field.                  */
  #define PWM_INTPEND_DMASEQ1END_Min (0x0UL)         /*!< Min enumerator value of DMASEQ1END field.                            */
  #define PWM_INTPEND_DMASEQ1END_Max (0x1UL)         /*!< Max enumerator value of DMASEQ1END field.                            */
  #define PWM_INTPEND_DMASEQ1END_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define PWM_INTPEND_DMASEQ1END_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* DMASEQ1READY @Bit 13 : Read pending status of interrupt for event DMASEQ1READY */
  #define PWM_INTPEND_DMASEQ1READY_Pos (13UL)        /*!< Position of DMASEQ1READY field.                                      */
  #define PWM_INTPEND_DMASEQ1READY_Msk (0x1UL << PWM_INTPEND_DMASEQ1READY_Pos) /*!< Bit mask of DMASEQ1READY field.            */
  #define PWM_INTPEND_DMASEQ1READY_Min (0x0UL)       /*!< Min enumerator value of DMASEQ1READY field.                          */
  #define PWM_INTPEND_DMASEQ1READY_Max (0x1UL)       /*!< Max enumerator value of DMASEQ1READY field.                          */
  #define PWM_INTPEND_DMASEQ1READY_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define PWM_INTPEND_DMASEQ1READY_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* DMASEQ1BUSERROR @Bit 14 : Read pending status of interrupt for event DMASEQ1BUSERROR */
  #define PWM_INTPEND_DMASEQ1BUSERROR_Pos (14UL)     /*!< Position of DMASEQ1BUSERROR field.                                   */
  #define PWM_INTPEND_DMASEQ1BUSERROR_Msk (0x1UL << PWM_INTPEND_DMASEQ1BUSERROR_Pos) /*!< Bit mask of DMASEQ1BUSERROR field.   */
  #define PWM_INTPEND_DMASEQ1BUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMASEQ1BUSERROR field.                       */
  #define PWM_INTPEND_DMASEQ1BUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMASEQ1BUSERROR field.                       */
  #define PWM_INTPEND_DMASEQ1BUSERROR_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define PWM_INTPEND_DMASEQ1BUSERROR_Pending (0x1UL) /*!< Read: Pending                                                       */

/* COMPAREMATCH0 @Bit 15 : Read pending status of interrupt for event COMPAREMATCH[0] */
  #define PWM_INTPEND_COMPAREMATCH0_Pos (15UL)       /*!< Position of COMPAREMATCH0 field.                                     */
  #define PWM_INTPEND_COMPAREMATCH0_Msk (0x1UL << PWM_INTPEND_COMPAREMATCH0_Pos) /*!< Bit mask of COMPAREMATCH0 field.         */
  #define PWM_INTPEND_COMPAREMATCH0_Min (0x0UL)      /*!< Min enumerator value of COMPAREMATCH0 field.                         */
  #define PWM_INTPEND_COMPAREMATCH0_Max (0x1UL)      /*!< Max enumerator value of COMPAREMATCH0 field.                         */
  #define PWM_INTPEND_COMPAREMATCH0_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define PWM_INTPEND_COMPAREMATCH0_Pending (0x1UL)  /*!< Read: Pending                                                        */

