NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
/* ADDRESS_RSSISTART @Bit 4 : Shortcut between event ADDRESS and task RSSISTART */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Pos (4UL)   /*!< Position of ADDRESS_RSSISTART field.                                 */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Msk (0x1UL << RADIO_SHORTS_ADDRESS_RSSISTART_Pos) /*!< Bit mask of ADDRESS_RSSISTART
                                                                            field.*/
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Min (0x0UL) /*!< Min enumerator value of ADDRESS_RSSISTART field.                     */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Max (0x1UL) /*!< Max enumerator value of ADDRESS_RSSISTART field.                     */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Disabled (0x0UL) /*!< Disable shortcut                                                */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Enabled (0x1UL) /*!< Enable shortcut                                                  */

/* END_START @Bit 5 : Shortcut between event END and task START */
  #define RADIO_SHORTS_END_START_Pos (5UL)           /*!< Position of END_START field.                                         */
  #define RADIO_SHORTS_END_START_Msk (0x1UL << RADIO_SHORTS_END_START_Pos) /*!< Bit mask of END_START field.                   */
  #define RADIO_SHORTS_END_START_Min (0x0UL)         /*!< Min enumerator value of END_START field.                             */
  #define RADIO_SHORTS_END_START_Max (0x1UL)         /*!< Max enumerator value of END_START field.                             */
  #define RADIO_SHORTS_END_START_Disabled (0x0UL)    /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_END_START_Enabled (0x1UL)     /*!< Enable shortcut                                                      */

/* ADDRESS_BCSTART @Bit 6 : Shortcut between event ADDRESS and task BCSTART */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Pos (6UL)     /*!< Position of ADDRESS_BCSTART field.                                   */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Msk (0x1UL << RADIO_SHORTS_ADDRESS_BCSTART_Pos) /*!< Bit mask of ADDRESS_BCSTART field. */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Min (0x0UL)   /*!< Min enumerator value of ADDRESS_BCSTART field.                       */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Max (0x1UL)   /*!< Max enumerator value of ADDRESS_BCSTART field.                       */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Disabled (0x0UL) /*!< Disable shortcut                                                  */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Enabled (0x1UL) /*!< Enable shortcut                                                    */

/* PHYEND_PLLEN @Bit 7 : Shortcut between event PHYEND and task PLLEN */
  #define RADIO_SHORTS_PHYEND_PLLEN_Pos (7UL)        /*!< Position of PHYEND_PLLEN field.                                      */
  #define RADIO_SHORTS_PHYEND_PLLEN_Msk (0x1UL << RADIO_SHORTS_PHYEND_PLLEN_Pos) /*!< Bit mask of PHYEND_PLLEN field.          */
  #define RADIO_SHORTS_PHYEND_PLLEN_Min (0x0UL)      /*!< Min enumerator value of PHYEND_PLLEN field.                          */
  #define RADIO_SHORTS_PHYEND_PLLEN_Max (0x1UL)      /*!< Max enumerator value of PHYEND_PLLEN field.                          */
  #define RADIO_SHORTS_PHYEND_PLLEN_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_PHYEND_PLLEN_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* TXREADY_START @Bit 17 : Shortcut between event TXREADY and task START */
  #define RADIO_SHORTS_TXREADY_START_Pos (17UL)      /*!< Position of TXREADY_START field.                                     */
  #define RADIO_SHORTS_TXREADY_START_Msk (0x1UL << RADIO_SHORTS_TXREADY_START_Pos) /*!< Bit mask of TXREADY_START field.       */
  #define RADIO_SHORTS_TXREADY_START_Min (0x0UL)     /*!< Min enumerator value of TXREADY_START field.                         */
  #define RADIO_SHORTS_TXREADY_START_Max (0x1UL)     /*!< Max enumerator value of TXREADY_START field.                         */
  #define RADIO_SHORTS_TXREADY_START_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_TXREADY_START_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* RXREADY_START @Bit 18 : Shortcut between event RXREADY and task START */
  #define RADIO_SHORTS_RXREADY_START_Pos (18UL)      /*!< Position of RXREADY_START field.                                     */
  #define RADIO_SHORTS_RXREADY_START_Msk (0x1UL << RADIO_SHORTS_RXREADY_START_Pos) /*!< Bit mask of RXREADY_START field.       */
  #define RADIO_SHORTS_RXREADY_START_Min (0x0UL)     /*!< Min enumerator value of RXREADY_START field.                         */
  #define RADIO_SHORTS_RXREADY_START_Max (0x1UL)     /*!< Max enumerator value of RXREADY_START field.                         */
  #define RADIO_SHORTS_RXREADY_START_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_RXREADY_START_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* PHYEND_DISABLE @Bit 19 : Shortcut between event PHYEND and task DISABLE */
  #define RADIO_SHORTS_PHYEND_DISABLE_Pos (19UL)     /*!< Position of PHYEND_DISABLE field.                                    */
  #define RADIO_SHORTS_PHYEND_DISABLE_Msk (0x1UL << RADIO_SHORTS_PHYEND_DISABLE_Pos) /*!< Bit mask of PHYEND_DISABLE field.    */
  #define RADIO_SHORTS_PHYEND_DISABLE_Min (0x0UL)    /*!< Min enumerator value of PHYEND_DISABLE field.                        */
  #define RADIO_SHORTS_PHYEND_DISABLE_Max (0x1UL)    /*!< Max enumerator value of PHYEND_DISABLE field.                        */
  #define RADIO_SHORTS_PHYEND_DISABLE_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define RADIO_SHORTS_PHYEND_DISABLE_Enabled (0x1UL) /*!< Enable shortcut                                                     */

