NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
/* POF @Bit 0 : Enable or disable power-fail comparator */
  #define REGULATORS_POFCON_POF_Pos (0UL)            /*!< Position of POF field.                                               */
  #define REGULATORS_POFCON_POF_Msk (0x1UL << REGULATORS_POFCON_POF_Pos) /*!< Bit mask of POF field.                           */
  #define REGULATORS_POFCON_POF_Min (0x0UL)          /*!< Min enumerator value of POF field.                                   */
  #define REGULATORS_POFCON_POF_Max (0x1UL)          /*!< Max enumerator value of POF field.                                   */
  #define REGULATORS_POFCON_POF_Disabled (0x0UL)     /*!< Disable                                                              */
  #define REGULATORS_POFCON_POF_Enabled (0x1UL)      /*!< Enable                                                               */

/* THRESHOLD @Bits 1..4 : Power-fail comparator threshold setting */
  #define REGULATORS_POFCON_THRESHOLD_Pos (1UL)      /*!< Position of THRESHOLD field.                                         */
  #define REGULATORS_POFCON_THRESHOLD_Msk (0xFUL << REGULATORS_POFCON_THRESHOLD_Pos) /*!< Bit mask of THRESHOLD field.         */
  #define REGULATORS_POFCON_THRESHOLD_Min (0x0UL)    /*!< Min enumerator value of THRESHOLD field.                             */
  #define REGULATORS_POFCON_THRESHOLD_Max (0xFUL)    /*!< Max enumerator value of THRESHOLD field.                             */
  #define REGULATORS_POFCON_THRESHOLD_V17 (0x0UL)    /*!< Set threshold to 1.7 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V18 (0x1UL)    /*!< Set threshold to 1.8 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V19 (0x2UL)    /*!< Set threshold to 1.9 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V20 (0x3UL)    /*!< Set threshold to 2.0 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V21 (0x4UL)    /*!< Set threshold to 2.1 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V22 (0x5UL)    /*!< Set threshold to 2.2 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V23 (0x6UL)    /*!< Set threshold to 2.3 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V24 (0x7UL)    /*!< Set threshold to 2.4 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V25 (0x8UL)    /*!< Set threshold to 2.5 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V26 (0x9UL)    /*!< Set threshold to 2.6 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V27 (0xAUL)    /*!< Set threshold to 2.7 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V28 (0xBUL)    /*!< Set threshold to 2.8 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V29 (0xCUL)    /*!< Set threshold to 2.9 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V30 (0xDUL)    /*!< Set threshold to 3.0 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V31 (0xEUL)    /*!< Set threshold to 3.1 V for VDD                                       */
  #define REGULATORS_POFCON_THRESHOLD_V32 (0xFUL)    /*!< Set threshold to 3.2 V for VDD                                       */

/* EVENTDISABLE @Bit 7 : Disable the POFWARN power-fail warning event */
  #define REGULATORS_POFCON_EVENTDISABLE_Pos (7UL)   /*!< Position of EVENTDISABLE field.                                      */
  #define REGULATORS_POFCON_EVENTDISABLE_Msk (0x1UL << REGULATORS_POFCON_EVENTDISABLE_Pos) /*!< Bit mask of EVENTDISABLE field.*/
  #define REGULATORS_POFCON_EVENTDISABLE_Min (0x0UL) /*!< Min enumerator value of EVENTDISABLE field.                          */
  #define REGULATORS_POFCON_EVENTDISABLE_Max (0x1UL) /*!< Max enumerator value of EVENTDISABLE field.                          */
  #define REGULATORS_POFCON_EVENTDISABLE_Enabled (0x0UL) /*!< POFWARN event is generated                                       */
  #define REGULATORS_POFCON_EVENTDISABLE_Disabled (0x1UL) /*!< POFWARN event is not generated                                  */


/* REGULATORS_POFSTAT: Power-fail comparator status register */
  #define REGULATORS_POFSTAT_ResetValue (0x00000000UL) /*!< Reset value of POFSTAT register.                                   */

/* COMPARATOR @Bit 0 : Power-fail comparator status */
  #define REGULATORS_POFSTAT_COMPARATOR_Pos (0UL)    /*!< Position of COMPARATOR field.                                        */
  #define REGULATORS_POFSTAT_COMPARATOR_Msk (0x1UL << REGULATORS_POFSTAT_COMPARATOR_Pos) /*!< Bit mask of COMPARATOR field.    */
  #define REGULATORS_POFSTAT_COMPARATOR_Min (0x0UL)  /*!< Min enumerator value of COMPARATOR field.                            */
  #define REGULATORS_POFSTAT_COMPARATOR_Max (0x1UL)  /*!< Max enumerator value of COMPARATOR field.                            */
  #define REGULATORS_POFSTAT_COMPARATOR_Above (0x0UL) /*!< Voltage detected above VPOF threshold                               */
  #define REGULATORS_POFSTAT_COMPARATOR_Below (0x1UL) /*!< Voltage detected below VPOF threshold                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RESET                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct RESET ======================================================= */
/**
  * @brief Reset control
  */
  typedef struct {                                   /*!< RESET Structure                                                      */
    __IM uint32_t RESERVED[384];
    __IOM uint32_t RESETREAS;                        /*!< (@ 0x00000600) Reset reason                                          */
  } NRF_RESET_Type;                                  /*!< Size = 1540 (0x604)                                                  */

/* RESET_RESETREAS: Reset reason */
  #define RESET_RESETREAS_ResetValue (0x00000000UL)  /*!< Reset value of RESETREAS register.                                   */

/* RESETPIN @Bit 0 : Reset from pin reset detected */
  #define RESET_RESETREAS_RESETPIN_Pos (0UL)         /*!< Position of RESETPIN field.                                          */
  #define RESET_RESETREAS_RESETPIN_Msk (0x1UL << RESET_RESETREAS_RESETPIN_Pos) /*!< Bit mask of RESETPIN field.                */
  #define RESET_RESETREAS_RESETPIN_Min (0x0UL)       /*!< Min enumerator value of RESETPIN field.                              */
  #define RESET_RESETREAS_RESETPIN_Max (0x1UL)       /*!< Max enumerator value of RESETPIN field.                              */
  #define RESET_RESETREAS_RESETPIN_NotDetected (0x0UL) /*!< Not detected                                                       */
  #define RESET_RESETREAS_RESETPIN_Detected (0x1UL)  /*!< Detected                                                             */

/* DOG0 @Bit 1 : Reset from watchdog timer 0 detected */
  #define RESET_RESETREAS_DOG0_Pos (1UL)             /*!< Position of DOG0 field.                                              */
  #define RESET_RESETREAS_DOG0_Msk (0x1UL << RESET_RESETREAS_DOG0_Pos) /*!< Bit mask of DOG0 field.                            */
  #define RESET_RESETREAS_DOG0_Min (0x0UL)           /*!< Min enumerator value of DOG0 field.                                  */
  #define RESET_RESETREAS_DOG0_Max (0x1UL)           /*!< Max enumerator value of DOG0 field.                                  */
  #define RESET_RESETREAS_DOG0_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_DOG0_Detected (0x1UL)      /*!< Detected                                                             */

/* CTRLAPSOFT @Bit 3 : Soft reset from CTRL-AP detected */
  #define RESET_RESETREAS_CTRLAPSOFT_Pos (3UL)       /*!< Position of CTRLAPSOFT field.                                        */
  #define RESET_RESETREAS_CTRLAPSOFT_Msk (0x1UL << RESET_RESETREAS_CTRLAPSOFT_Pos) /*!< Bit mask of CTRLAPSOFT field.          */
  #define RESET_RESETREAS_CTRLAPSOFT_Min (0x0UL)     /*!< Min enumerator value of CTRLAPSOFT field.                            */
  #define RESET_RESETREAS_CTRLAPSOFT_Max (0x1UL)     /*!< Max enumerator value of CTRLAPSOFT field.                            */
  #define RESET_RESETREAS_CTRLAPSOFT_NotDetected (0x0UL) /*!< Not detected                                                     */
  #define RESET_RESETREAS_CTRLAPSOFT_Detected (0x1UL) /*!< Detected                                                            */

