NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
/* RRAMC_EVENTS_WOKENUP: RRAMC is woken up from low power mode */
  #define RRAMC_EVENTS_WOKENUP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WOKENUP register.                          */

/* EVENTS_WOKENUP @Bit 0 : RRAMC is woken up from low power mode */
  #define RRAMC_EVENTS_WOKENUP_EVENTS_WOKENUP_Pos (0UL) /*!< Position of EVENTS_WOKENUP field.                                 */
  #define RRAMC_EVENTS_WOKENUP_EVENTS_WOKENUP_Msk (0x1UL << RRAMC_EVENTS_WOKENUP_EVENTS_WOKENUP_Pos) /*!< Bit mask of
                                                                            EVENTS_WOKENUP field.*/
  #define RRAMC_EVENTS_WOKENUP_EVENTS_WOKENUP_Min (0x0UL) /*!< Min enumerator value of EVENTS_WOKENUP field.                   */
  #define RRAMC_EVENTS_WOKENUP_EVENTS_WOKENUP_Max (0x1UL) /*!< Max enumerator value of EVENTS_WOKENUP field.                   */
  #define RRAMC_EVENTS_WOKENUP_EVENTS_WOKENUP_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define RRAMC_EVENTS_WOKENUP_EVENTS_WOKENUP_Generated (0x1UL) /*!< Event generated                                           */


/* RRAMC_EVENTS_READY: RRAMC is ready */
  #define RRAMC_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                              */

/* EVENTS_READY @Bit 0 : RRAMC is ready */
  #define RRAMC_EVENTS_READY_EVENTS_READY_Pos (0UL)  /*!< Position of EVENTS_READY field.                                      */
  #define RRAMC_EVENTS_READY_EVENTS_READY_Msk (0x1UL << RRAMC_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY
                                                                            field.*/
  #define RRAMC_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                         */
  #define RRAMC_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                         */
  #define RRAMC_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define RRAMC_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                               */


/* RRAMC_EVENTS_READYNEXT: Ready to accept a new write operation */
  #define RRAMC_EVENTS_READYNEXT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYNEXT register.                      */

/* EVENTS_READYNEXT @Bit 0 : Ready to accept a new write operation */
  #define RRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Pos (0UL) /*!< Position of EVENTS_READYNEXT field.                           */
  #define RRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Msk (0x1UL << RRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Pos) /*!< Bit mask of
                                                                            EVENTS_READYNEXT field.*/
  #define RRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYNEXT field.             */
  #define RRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYNEXT field.             */
  #define RRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define RRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Generated (0x1UL) /*!< Event generated                                       */


/* RRAMC_EVENTS_ACCESSERROR: RRAM access error */
  #define RRAMC_EVENTS_ACCESSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ACCESSERROR register.                  */

/* EVENTS_ACCESSERROR @Bit 0 : RRAM access error */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Pos (0UL) /*!< Position of EVENTS_ACCESSERROR field.                     */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Msk (0x1UL << RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Pos) /*!< Bit
                                                                            mask of EVENTS_ACCESSERROR field.*/
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACCESSERROR field.       */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACCESSERROR field.       */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Generated (0x1UL) /*!< Event generated                                   */


/* RRAMC_PUBLISH_WOKENUP: Publish configuration for event WOKENUP */
  #define RRAMC_PUBLISH_WOKENUP_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_WOKENUP register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event WOKENUP will publish to */
  #define RRAMC_PUBLISH_WOKENUP_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RRAMC_PUBLISH_WOKENUP_CHIDX_Msk (0xFFUL << RRAMC_PUBLISH_WOKENUP_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RRAMC_PUBLISH_WOKENUP_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RRAMC_PUBLISH_WOKENUP_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RRAMC_PUBLISH_WOKENUP_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RRAMC_PUBLISH_WOKENUP_EN_Msk (0x1UL << RRAMC_PUBLISH_WOKENUP_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RRAMC_PUBLISH_WOKENUP_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RRAMC_PUBLISH_WOKENUP_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RRAMC_PUBLISH_WOKENUP_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RRAMC_PUBLISH_WOKENUP_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


