NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
/* ================================================ Struct SPIM_SUBSCRIBE_DMA ================================================ */
/**
  * @brief SUBSCRIBE_DMA [SPIM_SUBSCRIBE_DMA] Subscribe configuration for tasks
  */
typedef struct {
  __IM  uint32_t  RESERVED[2];
  __IOM NRF_SPIM_SUBSCRIBE_DMA_RX_Type RX;           /*!< (@ 0x00000008) Subscribe configuration for tasks                     */
} NRF_SPIM_SUBSCRIBE_DMA_Type;                       /*!< Size = 40 (0x028)                                                    */


/* ================================================ Struct SPIM_EVENTS_DMA_RX ================================================ */
/**
  * @brief RX [SPIM_EVENTS_DMA_RX] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Generated after EasyDMA has completed its operation.  */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) An error occured during the bus transfer.             */
  __IOM uint32_t  MATCH[4];                          /*!< (@ 0x0000000C) Pattern match is detected on the DMA data bus.        */
} NRF_SPIM_EVENTS_DMA_RX_Type;                       /*!< Size = 28 (0x01C)                                                    */

/* SPIM_EVENTS_DMA_RX_END: Generated after EasyDMA has completed its operation. */
  #define SPIM_EVENTS_DMA_RX_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                   */

/* END @Bit 0 : Generated after EasyDMA has completed its operation. */
  #define SPIM_EVENTS_DMA_RX_END_END_Pos (0UL)       /*!< Position of END field.                                               */
  #define SPIM_EVENTS_DMA_RX_END_END_Msk (0x1UL << SPIM_EVENTS_DMA_RX_END_END_Pos) /*!< Bit mask of END field.                 */
  #define SPIM_EVENTS_DMA_RX_END_END_Min (0x0UL)     /*!< Min enumerator value of END field.                                   */
  #define SPIM_EVENTS_DMA_RX_END_END_Max (0x1UL)     /*!< Max enumerator value of END field.                                   */
  #define SPIM_EVENTS_DMA_RX_END_END_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define SPIM_EVENTS_DMA_RX_END_END_Generated (0x1UL) /*!< Event generated                                                    */


/* SPIM_EVENTS_DMA_RX_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                              to be written to prepare for the next sequence. */

  #define SPIM_EVENTS_DMA_RX_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */

  #define SPIM_EVENTS_DMA_RX_READY_READY_Pos (0UL)   /*!< Position of READY field.                                             */
  #define SPIM_EVENTS_DMA_RX_READY_READY_Msk (0x1UL << SPIM_EVENTS_DMA_RX_READY_READY_Pos) /*!< Bit mask of READY field.       */
  #define SPIM_EVENTS_DMA_RX_READY_READY_Min (0x0UL) /*!< Min enumerator value of READY field.                                 */
  #define SPIM_EVENTS_DMA_RX_READY_READY_Max (0x1UL) /*!< Max enumerator value of READY field.                                 */
  #define SPIM_EVENTS_DMA_RX_READY_READY_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define SPIM_EVENTS_DMA_RX_READY_READY_Generated (0x1UL) /*!< Event generated                                                */


/* SPIM_EVENTS_DMA_RX_BUSERROR: An error occured during the bus transfer. */
  #define SPIM_EVENTS_DMA_RX_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                         */

/* BUSERROR @Bit 0 : An error occured during the bus transfer. */
  #define SPIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                      */
  #define SPIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Msk (0x1UL << SPIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define SPIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                        */
  #define SPIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                        */
  #define SPIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define SPIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                          */


/* SPIM_EVENTS_DMA_RX_MATCH: Pattern match is detected on the DMA data bus. */
  #define SPIM_EVENTS_DMA_RX_MATCH_MaxCount (4UL)    /*!< Max size of MATCH[4] array.                                          */
  #define SPIM_EVENTS_DMA_RX_MATCH_MaxIndex (3UL)    /*!< Max index of MATCH[4] array.                                         */
  #define SPIM_EVENTS_DMA_RX_MATCH_MinIndex (0UL)    /*!< Min index of MATCH[4] array.                                         */
  #define SPIM_EVENTS_DMA_RX_MATCH_ResetValue (0x00000000UL) /*!< Reset value of MATCH[4] register.                            */

/* MATCH @Bit 0 : Pattern match is detected on the DMA data bus. */
  #define SPIM_EVENTS_DMA_RX_MATCH_MATCH_Pos (0UL)   /*!< Position of MATCH field.                                             */
  #define SPIM_EVENTS_DMA_RX_MATCH_MATCH_Msk (0x1UL << SPIM_EVENTS_DMA_RX_MATCH_MATCH_Pos) /*!< Bit mask of MATCH field.       */
  #define SPIM_EVENTS_DMA_RX_MATCH_MATCH_Min (0x0UL) /*!< Min enumerator value of MATCH field.                                 */
  #define SPIM_EVENTS_DMA_RX_MATCH_MATCH_Max (0x1UL) /*!< Max enumerator value of MATCH field.                                 */
  #define SPIM_EVENTS_DMA_RX_MATCH_MATCH_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define SPIM_EVENTS_DMA_RX_MATCH_MATCH_Generated (0x1UL) /*!< Event generated                                                */



/* ================================================ Struct SPIM_EVENTS_DMA_TX ================================================ */
/**
  * @brief TX [SPIM_EVENTS_DMA_TX] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Generated after EasyDMA has completed its operation.  */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) An error occured during the bus transfer.             */
} NRF_SPIM_EVENTS_DMA_TX_Type;                       /*!< Size = 12 (0x00C)                                                    */

/* SPIM_EVENTS_DMA_TX_END: Generated after EasyDMA has completed its operation. */
  #define SPIM_EVENTS_DMA_TX_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                   */

/* END @Bit 0 : Generated after EasyDMA has completed its operation. */
  #define SPIM_EVENTS_DMA_TX_END_END_Pos (0UL)       /*!< Position of END field.                                               */
  #define SPIM_EVENTS_DMA_TX_END_END_Msk (0x1UL << SPIM_EVENTS_DMA_TX_END_END_Pos) /*!< Bit mask of END field.                 */
  #define SPIM_EVENTS_DMA_TX_END_END_Min (0x0UL)     /*!< Min enumerator value of END field.                                   */
  #define SPIM_EVENTS_DMA_TX_END_END_Max (0x1UL)     /*!< Max enumerator value of END field.                                   */
  #define SPIM_EVENTS_DMA_TX_END_END_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define SPIM_EVENTS_DMA_TX_END_END_Generated (0x1UL) /*!< Event generated                                                    */


/* SPIM_EVENTS_DMA_TX_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                              to be written to prepare for the next sequence. */

