NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
/* TAMPC_PROTECT_ERASEPROTECT_STATUS: Status register for eraseprotect. */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                     */

/* ERROR @Bit 0 : Error detection status. */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Pos (0UL) /*!< Position of ERROR field.                                      */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Msk (0x1UL << TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Pos) /*!< Bit mask of
                                                                            ERROR field.*/
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Min (0x0UL) /*!< Min enumerator value of ERROR field.                        */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Max (0x1UL) /*!< Max enumerator value of ERROR field.                        */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_NoError (0x0UL) /*!< No error detected.                                      */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Error (0x1UL) /*!< Error detected.                                           */



/* ================================================== Struct TAMPC_PROTECT =================================================== */
/**
  * @brief PROTECT [TAMPC_PROTECT] (unspecified)
  */
typedef struct {
  __IOM NRF_TAMPC_PROTECT_DOMAIN_Type DOMAIN[1];     /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED[120];
  __IOM NRF_TAMPC_PROTECT_AP_Type AP[1];             /*!< (@ 0x00000200) (unspecified)                                         */
  __IM  uint32_t  RESERVED1[90];
  __IOM NRF_TAMPC_PROTECT_GPIOSWD_Type GPIOSWD;      /*!< (@ 0x00000378) Enable GPIO functionality on SWD pins.                */
  __IM  uint32_t  RESERVED2[48];
  __IOM NRF_TAMPC_PROTECT_GLITCHSLOWDOMAIN_Type GLITCHSLOWDOMAIN; /*!< (@ 0x00000440) Enable slow domain glitch detectors.     */
  __IOM NRF_TAMPC_PROTECT_GLITCHFASTDOMAIN_Type GLITCHFASTDOMAIN; /*!< (@ 0x00000448) Enable fast domain glitch detectors.     */
  __IM  uint32_t  RESERVED3[10];
  __IOM NRF_TAMPC_PROTECT_INTRESETEN_Type INTRESETEN; /*!< (@ 0x00000478) Trigger a reset when tamper is detected by the glitch
                                                                          detectors, signal protector or CRACEN tamper
                                                                          detector.*/
  __IOM NRF_TAMPC_PROTECT_ERASEPROTECT_Type ERASEPROTECT; /*!< (@ 0x00000480) Device erase protection.                         */
} NRF_TAMPC_PROTECT_Type;                            /*!< Size = 1160 (0x488)                                                  */

/* ====================================================== Struct TAMPC ======================================================= */
/**
  * @brief Tamper controller
  */
  typedef struct {                                   /*!< TAMPC Structure                                                      */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_TAMPER;                    /*!< (@ 0x00000100) Tamper controller detected an error.                  */
    __IOM uint32_t EVENTS_WRITEERROR;                /*!< (@ 0x00000104) Attempt to write a VALUE in PROTECT registers without
                                                                         clearing the WRITEPROTECT.*/
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t STATUS;                           /*!< (@ 0x00000400) The tamper controller status.                         */
    __IM uint32_t RESERVED3[63];
    __IOM NRF_TAMPC_PROTECT_Type PROTECT;            /*!< (@ 0x00000500) (unspecified)                                         */
  } NRF_TAMPC_Type;                                  /*!< Size = 2440 (0x988)                                                  */

/* TAMPC_EVENTS_TAMPER: Tamper controller detected an error. */
  #define TAMPC_EVENTS_TAMPER_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TAMPER register.                            */

/* EVENTS_TAMPER @Bit 0 : Tamper controller detected an error. */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Pos (0UL) /*!< Position of EVENTS_TAMPER field.                                    */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Msk (0x1UL << TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Pos) /*!< Bit mask of EVENTS_TAMPER
                                                                            field.*/
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Min (0x0UL) /*!< Min enumerator value of EVENTS_TAMPER field.                      */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Max (0x1UL) /*!< Max enumerator value of EVENTS_TAMPER field.                      */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Generated (0x1UL) /*!< Event generated                                             */


/* TAMPC_EVENTS_WRITEERROR: Attempt to write a VALUE in PROTECT registers without clearing the WRITEPROTECT. */
  #define TAMPC_EVENTS_WRITEERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WRITEERROR register.                    */

/* EVENTS_WRITEERROR @Bit 0 : Attempt to write a VALUE in PROTECT registers without clearing the WRITEPROTECT. */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Pos (0UL) /*!< Position of EVENTS_WRITEERROR field.                        */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Msk (0x1UL << TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Pos) /*!< Bit mask
                                                                            of EVENTS_WRITEERROR field.*/
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_WRITEERROR field.          */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_WRITEERROR field.          */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Generated (0x1UL) /*!< Event generated                                     */


/* TAMPC_INTEN: Enable or disable interrupt */
  #define TAMPC_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

