NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
  #define UARTE_DMA_TX_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                   */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define UARTE_DMA_TX_AMOUNT_AMOUNT_Pos (0UL)       /*!< Position of AMOUNT field.                                            */
  #define UARTE_DMA_TX_AMOUNT_AMOUNT_Msk (0xFFFFUL << UARTE_DMA_TX_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.           */
  #define UARTE_DMA_TX_AMOUNT_AMOUNT_Min (0x0001UL)  /*!< Min value of AMOUNT field.                                           */
  #define UARTE_DMA_TX_AMOUNT_AMOUNT_Max (0xFFFFUL)  /*!< Max size of AMOUNT field.                                            */


/* UARTE_DMA_TX_LIST: EasyDMA list type */
  #define UARTE_DMA_TX_LIST_ResetValue (0x00000000UL) /*!< Reset value of LIST register.                                       */

/* TYPE @Bits 0..2 : List type */
  #define UARTE_DMA_TX_LIST_TYPE_Pos (0UL)           /*!< Position of TYPE field.                                              */
  #define UARTE_DMA_TX_LIST_TYPE_Msk (0x7UL << UARTE_DMA_TX_LIST_TYPE_Pos) /*!< Bit mask of TYPE field.                        */
  #define UARTE_DMA_TX_LIST_TYPE_Min (0x0UL)         /*!< Min enumerator value of TYPE field.                                  */
  #define UARTE_DMA_TX_LIST_TYPE_Max (0x1UL)         /*!< Max enumerator value of TYPE field.                                  */
  #define UARTE_DMA_TX_LIST_TYPE_Disabled (0x0UL)    /*!< Disable EasyDMA list                                                 */
  #define UARTE_DMA_TX_LIST_TYPE_ArrayList (0x1UL)   /*!< Use array list                                                       */


/* UARTE_DMA_TX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.         */

/* ENABLE @Bit 0 : (unspecified) */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                     */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                       */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                       */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                  */


/* UARTE_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                 */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ==================================================== Struct UARTE_DMA ===================================================== */
/**
  * @brief DMA [UARTE_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_UARTE_DMA_RX_Type RX;                    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UARTE_DMA_TX_Type TX;                    /*!< (@ 0x00000038) (unspecified)                                         */
} NRF_UARTE_DMA_Type;                                /*!< Size = 92 (0x05C)                                                    */

/* ====================================================== Struct UARTE ======================================================= */
/**
  * @brief UART with EasyDMA
  */
  typedef struct {                                   /*!< UARTE Structure                                                      */
    __IM uint32_t RESERVED[7];
    __OM uint32_t TASKS_FLUSHRX;                     /*!< (@ 0x0000001C) Flush RX FIFO into RX buffer                          */
    __IM uint32_t RESERVED1[2];
    __OM NRF_UARTE_TASKS_DMA_Type TASKS_DMA;         /*!< (@ 0x00000028) Peripheral tasks.                                     */
    __OM uint32_t TASKS_DMAEND;                      /*!< (@ 0x00000058) Store any buffered data into memory and stop DMA
                                                                         afterwards*/
    __IM uint32_t RESERVED2[16];
    __IOM uint32_t SUBSCRIBE_FLUSHRX;                /*!< (@ 0x0000009C) Subscribe configuration for task FLUSHRX              */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_UARTE_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA; /*!< (@ 0x000000A8) Subscribe configuration for tasks                    */
    __IOM uint32_t SUBSCRIBE_DMAEND;                 /*!< (@ 0x000000D8) Subscribe configuration for task DMAEND               */
    __IM uint32_t RESERVED4[9];
    __IOM uint32_t EVENTS_CTS;                       /*!< (@ 0x00000100) CTS is activated (set low). Clear To Send.            */
    __IOM uint32_t EVENTS_NCTS;                      /*!< (@ 0x00000104) CTS is deactivated (set high). Not Clear To Send.     */
    __IM uint32_t RESERVED5;
    __IOM uint32_t EVENTS_TXDRDY;                    /*!< (@ 0x0000010C) Data sent from TXD                                    */
    __IOM uint32_t EVENTS_RXDRDY;                    /*!< (@ 0x00000110) Data received in RXD (but potentially not yet
                                                                         transferred to Data RAM)*/
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000114) Error detected                                        */
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t EVENTS_RXTO;                      /*!< (@ 0x00000124) Receiver timeout                                      */
    __IM uint32_t RESERVED7[2];
    __IOM uint32_t EVENTS_TXSTOPPED;                 /*!< (@ 0x00000130) Transmitter stopped                                   */
    __IM uint32_t RESERVED8[6];
    __IOM NRF_UARTE_EVENTS_DMA_Type EVENTS_DMA;      /*!< (@ 0x0000014C) Peripheral events.                                    */
    __IOM uint32_t EVENTS_FRAMETIMEOUT;              /*!< (@ 0x00000174) Timed out due to bus being idle while receiving data. */
    __IM uint32_t RESERVED9[2];
    __IOM uint32_t PUBLISH_CTS;                      /*!< (@ 0x00000180) Publish configuration for event CTS                   */
    __IOM uint32_t PUBLISH_NCTS;                     /*!< (@ 0x00000184) Publish configuration for event NCTS                  */
    __IM uint32_t RESERVED10;
    __IOM uint32_t PUBLISH_TXDRDY;                   /*!< (@ 0x0000018C) Publish configuration for event TXDRDY                */
    __IOM uint32_t PUBLISH_RXDRDY;                   /*!< (@ 0x00000190) Publish configuration for event RXDRDY                */
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x00000194) Publish configuration for event ERROR                 */
    __IM uint32_t RESERVED11[3];
    __IOM uint32_t PUBLISH_RXTO;                     /*!< (@ 0x000001A4) Publish configuration for event RXTO                  */
    __IM uint32_t RESERVED12[2];
    __IOM uint32_t PUBLISH_TXSTOPPED;                /*!< (@ 0x000001B0) Publish configuration for event TXSTOPPED             */
    __IM uint32_t RESERVED13[6];
    __IOM NRF_UARTE_PUBLISH_DMA_Type PUBLISH_DMA;    /*!< (@ 0x000001CC) Publish configuration for events                      */
    __IOM uint32_t PUBLISH_FRAMETIMEOUT;             /*!< (@ 0x000001F4) Publish configuration for event FRAMETIMEOUT          */
    __IM uint32_t RESERVED14[2];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED15[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED16[93];
    __IOM uint32_t ERRORSRC;                         /*!< (@ 0x00000480) Error source                                          */
    __IM uint32_t RESERVED17[31];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable UART                                           */
    __IM uint32_t RESERVED18[8];
    __IOM uint32_t BAUDRATE;                         /*!< (@ 0x00000524) Baud rate. Accuracy depends on the HFCLK source
                                                                         selected.*/
    __IM uint32_t RESERVED19[17];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000056C) Configuration of parity, hardware flow control,
                                                                         framesize, and packet timeout.*/
    __IM uint32_t RESERVED20;
    __IOM uint32_t ADDRESS;                          /*!< (@ 0x00000574) Set the address of the UARTE for RX when used in 9 bit
                                                                         data frame mode.*/
    __IOM uint32_t FRAMETIMEOUT;                     /*!< (@ 0x00000578) Set the number of UARTE bits to count before triggering
                                                                         packet timeout.*/
    __IM uint32_t RESERVED21[34];
    __IOM NRF_UARTE_PSEL_Type PSEL;                  /*!< (@ 0x00000604) (unspecified)                                         */
    __IM uint32_t RESERVED22[59];
    __IOM NRF_UARTE_DMA_Type DMA;                    /*!< (@ 0x00000700) (unspecified)                                         */
  } NRF_UARTE_Type;                                  /*!< Size = 1884 (0x75C)                                                  */

/* UARTE_TASKS_FLUSHRX: Flush RX FIFO into RX buffer */
  #define UARTE_TASKS_FLUSHRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FLUSHRX register.                            */

