NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_types.h
/* WDT_INTEN: Enable or disable interrupt */
  #define WDT_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* TIMEOUT @Bit 0 : Enable or disable interrupt for event TIMEOUT */
  #define WDT_INTEN_TIMEOUT_Pos (0UL)                /*!< Position of TIMEOUT field.                                           */
  #define WDT_INTEN_TIMEOUT_Msk (0x1UL << WDT_INTEN_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.                               */
  #define WDT_INTEN_TIMEOUT_Min (0x0UL)              /*!< Min enumerator value of TIMEOUT field.                               */
  #define WDT_INTEN_TIMEOUT_Max (0x1UL)              /*!< Max enumerator value of TIMEOUT field.                               */
  #define WDT_INTEN_TIMEOUT_Disabled (0x0UL)         /*!< Disable                                                              */
  #define WDT_INTEN_TIMEOUT_Enabled (0x1UL)          /*!< Enable                                                               */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define WDT_INTEN_STOPPED_Pos (1UL)                /*!< Position of STOPPED field.                                           */
  #define WDT_INTEN_STOPPED_Msk (0x1UL << WDT_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                               */
  #define WDT_INTEN_STOPPED_Min (0x0UL)              /*!< Min enumerator value of STOPPED field.                               */
  #define WDT_INTEN_STOPPED_Max (0x1UL)              /*!< Max enumerator value of STOPPED field.                               */
  #define WDT_INTEN_STOPPED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define WDT_INTEN_STOPPED_Enabled (0x1UL)          /*!< Enable                                                               */


/* WDT_INTENSET: Enable interrupt */
  #define WDT_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* TIMEOUT @Bit 0 : Write '1' to enable interrupt for event TIMEOUT */
  #define WDT_INTENSET_TIMEOUT_Pos (0UL)             /*!< Position of TIMEOUT field.                                           */
  #define WDT_INTENSET_TIMEOUT_Msk (0x1UL << WDT_INTENSET_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.                         */
  #define WDT_INTENSET_TIMEOUT_Min (0x0UL)           /*!< Min enumerator value of TIMEOUT field.                               */
  #define WDT_INTENSET_TIMEOUT_Max (0x1UL)           /*!< Max enumerator value of TIMEOUT field.                               */
  #define WDT_INTENSET_TIMEOUT_Set (0x1UL)           /*!< Enable                                                               */
  #define WDT_INTENSET_TIMEOUT_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_INTENSET_TIMEOUT_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define WDT_INTENSET_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define WDT_INTENSET_STOPPED_Msk (0x1UL << WDT_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define WDT_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define WDT_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define WDT_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define WDT_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */


/* WDT_INTENCLR: Disable interrupt */
  #define WDT_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* TIMEOUT @Bit 0 : Write '1' to disable interrupt for event TIMEOUT */
  #define WDT_INTENCLR_TIMEOUT_Pos (0UL)             /*!< Position of TIMEOUT field.                                           */
  #define WDT_INTENCLR_TIMEOUT_Msk (0x1UL << WDT_INTENCLR_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.                         */
  #define WDT_INTENCLR_TIMEOUT_Min (0x0UL)           /*!< Min enumerator value of TIMEOUT field.                               */
  #define WDT_INTENCLR_TIMEOUT_Max (0x1UL)           /*!< Max enumerator value of TIMEOUT field.                               */
  #define WDT_INTENCLR_TIMEOUT_Clear (0x1UL)         /*!< Disable                                                              */
  #define WDT_INTENCLR_TIMEOUT_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_INTENCLR_TIMEOUT_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define WDT_INTENCLR_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define WDT_INTENCLR_STOPPED_Msk (0x1UL << WDT_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define WDT_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define WDT_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define WDT_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define WDT_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */


/* WDT_INTPEND: Pending interrupts */
  #define WDT_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

